
var турист = new Турист();
турист.Имя = "Майкл";
турист.Возраст = 32;
турист.Место = "Китай";


var куртка = new ВерхняяОдежда();
куртка.Цвет = "Красный";
куртка.Размер = "XL";
куртка.Цена = 5500;
куртка.ShowText();
var пальто = new ВерхняяОдежда();
пальто.Цвет = "Серый";
пальто.Размер = "L";
пальто.Цена = 4000;
пальто.ShowText();
var шуба = new ВерхняяОдежда();
шуба.Цвет = "Черный";
шуба.Размер = "S";
шуба.Цена = 100000;
шуба.ShowText();



var ученик1 = new Ученик();
ученик1.Имя = "Миша";
ученик1.Предмет = "Биология";
ученик1.НомерКласса = 10;
var ученик2 = new Ученик();
ученик2.Имя = "Маша";
ученик2.Предмет = "Алгебра";
ученик2.НомерКласса = 8;

